from string import Template

#### System ####
system_prompt = Template("\n".join([
    "أنت مساعد لتوليد ملخص وافي للمستخدم.",
    "ستحصل علي النص المراد تلخصيه ويجب عليك توليد ملخص يحتوي علي النقاط اللاساسية في النص الاصلي.",
    "يجب ان يكون الملخص مختصرًا ودقيقًا ويحتوي فقط علي المعلومات الهامة.",
    "التزم بمحتوي النص المرفق فقط ولا تضف اي معلومات خارجية.",
]))

#### Footer ####
footer_prompt = Template("\n".join([
    "النص الأصلي المراد تلخيصه:",
    "$text",
    "",
    "## الملخص:",
]))
